[
  { "id": 0
  , "slug": "smarty"
  , "title": "Smarty AI"
  , "subtitle": "UI/UX, User research"
  , "description": "Smarty unifies task management & calendar scheduling into one clean application powered by AI."
  , "summary": "Principle product designer, creating the core interface for Smarty. Working closely with the CEO and engineering team, conducted user research and synthesized analysis into validated value propositions, created the foundational product app interface, as well as provided design strategy for the product roadmap. Smarty AI is still in active development."
  , "backgroundColor": "#17486D"
  , "imageKey": "smarty"
  , "indexImage": "index_mcyprd.png"
  , "sections":
      [ { "projectSectionHeader": "Context"
        , "projectSectionText":
            { "textCopy": "Smarty is an AI-powered personal productivity tool, built on top of an NLP (natural language processing) interface and artificial intelligence engine. With the goal to let users enter free form text which Smarty automatically recognizes by keywords and generatively schedules: to create tasks, events, and convert emails into action items."
            , "textType": "paragraph"
            }
        , "imageType": "none"
        , "fullscreen": false
        }
      , { "imageFile": "2023-Dec/user-research/user-persona_zkofzx.png"
        , "projectSectionHeader": "User research"
        , "projectSectionText":
            { "textCopy": "Our target personas were identified as executive assistants and other professionals overwhelmed with scheduling obligations. From there we created persona profiles, user journey maps, as well as conducted rounds of user interviews. In our interviews we focused on how people organize & structure their schedule over the course of week, and what were their pain points & goals when planning out objectives for their calendar."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2024-April/EA_journey_map_imon7h.png"
        , "projectSectionHeader": "Pain point mapping"
        , "projectSectionText":
            { "textCopy": "A pain point map was created to visualize the flow of how users planned & scheduled with their existing tools & workflows. Tracking their actions, feelings & questions, as well as points of friction that could be leveraged into opportunities in each step of their flow."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "projectSectionHeader": "Analysis"
        , "projectSectionText":
            { "textCopy": "After conducting rounds of user interviews and discovery, we summarized 3 different possible value propositions for our initial feature set & the core design principles, and organized our findings synthesized into a Jobs to Be Done statement:"
            , "textType": "paragraph"
            }
        , "imageType": "none"
        , "fullscreen": false
        }
      , { "projectSectionText":
            { "textCopy": "\"When I’m newly overwhelmed by an overflowing plate and the meetings/tasks keep coming, I want to easily track my workload (via smart visualization and automatic re-prioritization), so I can have mental clarity and confidence each day.\""
            , "textType": "quote"
            }
        , "imageType": "none"
        , "fullscreen": false
        }
      , { "projectSectionHeader": "Value propositions"
        , "projectSectionText":
          { "columnCopy":
              [ "• Task tracking & management"
              , "• Automated scheduling"
              , "• Integrations"
              ]
          , "textType": "columns"
          }
        , "imageType": "none"
        , "fullscreen": false
        }
      , { "projectSectionText":
          { "textCopy": "Based on our insights from user research & market analysis, and supported by an examination of existing systems & methodologies, Smarty's UI was redesigned on top of a natural language processing engine with AI auto-scheduling that will schedule tasks & events based on priority. The app UI was designed to let users build content through a clean textual interface, allowing users to conversationally create tasks/events and schedule them."
          , "textType": "paragraph"
          }
        , "imageType": "none"
        , "fullscreen": false
        }
      , { "imageFile": "2023-Dec/user-research/feature-set_fqpor2.png"
        , "projectSectionHeader": "Design principles"
        , "projectSectionText":
          { "columnCopy":
              [ "• Simplicity & transparency"
              , "• A clean/minimal interface"
              , "• Easy to maintain"
              ]
          , "textType": "columns"
          }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "projectSectionHeader": "A new purely textually scheduling interface"
        , "projectSectionText":
            { "textCopy": "Informed by our research findings & user feedback, a new app interface was designed focused on the core principles of \"simplicity & transparency\" and \"a clean/minimal interface\". Additionally, from our research we learned that our target users wanted to be able to quickly jot down tasks or events at hand (without needing to fill out a time-consuming form) and have the product recognize parameters from keywords."
            , "textType": "paragraph"
            }
        , "imageType": "none"
        , "fullscreen": false
        }
      , { "imageFile": "2024-April/smarty-update2_xwedkz.gif"
        , "projectSectionText":
            { "columnCopy":
                [ "• Powered by natural language"
                , "• Automated scheduling"
                , "• A clean/focused UI"
                ]
            , "textType": "columns"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2024-April/homepage_-_calendar_view_a5h9xw.jpg"
        , "projectSectionHeader": "Comparative focus views"
        , "projectSectionText":
            { "textCopy": "Users can visually compare their calendar view to a textual list layout to see how any given day is structured, and drag/drop between the two interfaces. In addition to the command menu to textually organize & schedule, user can also create content & visualize organization of their tasks & events via the textual list panel or the default calendar interface."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2024-April/homepage_-_list_view_larid1.jpg"
        , "projectSectionText":
          { "textCopy": "Additionally, user can toggle between the views; with list view as the main interface and the calendar as a panel for visual comparison."
          , "textType": "paragraph"
          }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2024-April/homepage_-_calendar_view_integrations_panel_pwed2i.jpg"
        , "projectSectionHeader": "Email integration"
        , "projectSectionText":
          { "textCopy": "A powerful feature requested from users during testing & interviews, was to create follow-up tasks & events based on emails. With an integration to GMail, users can view their email inbox in comparison to their schedule, and easily create tasks or events that reference back to the email trigger."
          , "textType": "paragraph"
          }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2024-April/email-reference_hx5vko.jpg"
        , "projectSectionText":
          { "textCopy": ""
          , "textType": "none"
          }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2024-April/Smarty_design_system_xha8wd.jpg"
        , "projectSectionHeader": "Modular component library & design system"
        , "projectSectionText":
            { "columnCopy":
              [ "To aid in design/dev efficiency, I built a reusable modular component library based on atomic design principles to establish a scalable design system."
              , "This allowed Smarty to maintain branded consistency as new features are being developed."
              ]
            , "textType": "columns"
          }
        , "imageType": "screenshot"
        , "fullscreen": true
        }
      , { "projectSectionHeader": "In summary"
        , "projectSectionText":
            { "textCopy": "Smarty is still in active development, but based on prototype testing with users there is active interest in the product's email to task/event creation integration as well as resounding preference for the purely textual NLP driven UI to easily create & edit scheduling content without having to engage with multiple click-through behaviors with the previous form-heavy interface."
            , "textType": "paragraph"
            }
        , "imageType": "none"
        }
      ]
  , "skills":
      [ "Product Design & Strategy"
      , "UX Research"
      , "Interface design"
      ]
  , "industry":
      [ "AI/Natural Language Processing"
      , "Task management"
      , "Calendar scheduling"
      ]
  , "productType":
      [ "Personal productivity application"
      ]
  },
  { "id": 1
  , "slug": "lumi"
  , "title": "Lumi"
  , "subtitle": "UI/UX, Development"
  , "description": "Lumi helps businesses produce custom packaging and handle supply chain logistics."
  , "summary": "Product designer and UI/UX developer transforming Lumi from an e-commerce platform into a B2B marketplace connecting businesses to packaging manufacturers. Providing users with custom packaging & improved efficiency in supply chain logistics, as well as the creation of a design system & modular UI component library to maintain cohesiveness across Lumi's various app user interfaces and visual design"
  , "backgroundColor": "#DBD624"
  , "imageKey": "lumi"
  , "indexImage": "index_twciyu.png"
  , "fullscreen": false
  , "sections":
      [ { "imageFile": "desktop-01_crelk5.png"
        , "projectSectionHeader": "Where we started"
        , "projectSectionText":
            { "textCopy": "Originally Lumi operated as an e-commerce catalog of predefined packaging materials that businesses could apply branded designs to. However, if users wanted customized designs or unique packaging options, their requests had to be handled manually by customer experience representatives & packaging design experts. And users were limited to Lumi's preselected packaging suppliers with little transparency around who would be manufacturing their packaging or the ability to compare quotes from different suppliers."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "desktop-02_esmwtr.png"
        , "projectSectionText":
            { "textCopy": ""
            , "textType": "none"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "projectSectionHeader": "The problem"
        , "projectSectionText":
            { "textCopy": "Because many business users required a high level of specificity for their branded packaging requirements and our in-house CX team managed the flow of information between businesses & packaging manufacturers, as Lumi scaled with more users this resulted in communication bottlenecks & production errors. And to better serve users' diverse packaging needs we wanted to allow businesses to compare across a network of packaging suppliers by cost or turn around times."
            , "textType": "paragraph"
            }
        , "imageType": "none"
        }
      , { "imageFile": "April 2024/User_research_sden3e.png"
        , "projectSectionText":
            { "columnCopy":
                [ "UX research was performed to map out the workflows for a business's custom packaging needs from creation, to submitting out for quoting to either a specific manufacturer or to a marketplace of manufacturers for comparison."
                , "Additionally we conducted an analysis on how packaging manufacturers' review potential orders from clients, and the process to respond & bid on these opportunities."
                ]
            , "textType": "columns"
            }
        , "imageType": "screenshot"
        , "fullscreen": true
        }
      , { "imageFile": "2023-Dec/FJ-items-page_ehtyzj.jpg"
        , "projectSectionHeader": "The solution"
        , "projectSectionText":
            { "columnCopy":
                [ "Based on this research, the app interface was redesigned from a catalog UI to a dashboard interface optimized for business users to create detailed customizable packaging & allowing them to select their best suited packaging supplier."
                , "To aid brands in creating their custom specifications, a guided workflow UI was designed that provided step-by-step instructions for users to add custom specifications, design files & proofs, and then submit into a B2B marketplace of manufacturers for comparative quoting."
                ]
            , "textType": "columns"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2023-Dec/FJ-quoting-page_ws5te3.jpg"
        , "projectSectionHeader": "Comparing quotes"
        , "projectSectionText":
            { "textCopy": "Manufacturers' responses to packaging needs were displayed in a high-density data UI reflecting the nuances of producing each custom product, essential information about projected quotes (quantity, price & turnaround times), as well as linking to detailed profiles about the manufacturer themselves, allowing brands to easily compare across different possible manufacturing resources."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2023-Dec/FJ-network-page_wpm5zq.jpg"
        , "projectSectionHeader": "Picking the right supplier"
        , "projectSectionText":
            { "textCopy": "To assist businesses in comparing across an ecosystem of many manufacturers, a marketplace reference UI was created for displaying rich data regarding each manufacturer's production capabilities, location & shipping times, sustainability efforts, and reviews from other clients."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "2023-Dec/Bravo-opportunities-page_yik29s.jpg"
        , "projectSectionHeader": "A dashboard for suppliers"
        , "projectSectionText":
            { "columnCopy":
                [ "Manufacturers could respond to each custom packaging request from their own focused dashboard interface, supporting a marketplace of potential opportunities, buyers' direct requests for custom packaging, and to track & manage potential orders."
                , "The manufacturer dashboard utilizes the same UI component library to standardize visual cohesiveness, but with a UX focus on the manufacture's need to respond to client requests, provide quotes, feedback, status updates, and tracking order fulfillment."
                ]
            , "textType": "columns"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "April 2024/Lumi_design_system_faqypc.jpg"
        , "projectSectionHeader": "Modular component library & design system"
        , "projectSectionText":
            { "columnCopy":
              [ "As Lumi scaled into a B2B marketplace with multiple product dashboards, we designed & built a reusable modular component library based on atomic design principles to establish a scalable design system."
              , "This allowed our team to maintain branded consistency & improve turnaround efficiency for new features in each of the B2B marketplace's product touch points."
              ]
            , "textType": "columns"
          }
        , "imageType": "screenshot"
        , "fullscreen": true
        }
      , { "projectSectionHeader": "The results"
        , "projectSectionText":
            { "textCopy": "With the transition to a B2B marketplace application from the prior iteration as an e-commerce catalog interface with predefined packaging options, our team reduced average quote request response time by 85%. Thus allowing Lumi to scale up in numbers of users, improving the custom packaging experience, adding transparency for our users, and increasing sales."
            , "textType": "paragraph"
            }
        , "imageType": "none"
        }
    ]
  , "skills":
      [ "Product Design"
      , "User research"
      , "Design System"
      , "Component Library"
      , "UI/UX Development"
      ]
  , "industry":
      [ "Packaging design"
      , "Supply chain logistics"
      ]
  , "productType":
      [ "B2B marketplace"
      , "SaSS"
      ]
  },
  { "id": 1
  , "slug": "lumi-id"
  , "title": "Lumi ID"
  , "subtitle": "UI/UX, Development"
  , "description": "Lumi ID is a digital identification tool that gives users accurate, localized information about how brand packaging is made, and how to recycle it responsibly with a single QR code."
  , "summary": "Product designer and front-end developer of a mobile-first digital experience triggered from physical products via QR codes to support sustainability & transparency in packaging."
  , "backgroundColor": "#E9BD98"
  , "imageKey": "lumi-id"
  , "indexImage": "index_fhzdbn.jpg"
  , "fullscreen": false
  , "sections":
      [ { "imageFile": "Lumi-ID-homepage_jiawcg.png"
        , "projectSectionHeader": "Context"
        , "projectSectionText":
            { "textCopy": "Lumi ID integrates seamlessly with branding, messaging and physical product. Lumi ID generates a QR code that can be printed on any packaging including boxes, envelopes, jars, bottles, cans, tubes, publications, labels and collateral. As new platform features and best practices become available, packaging information stays accurate without requiring print plate changes."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "lumi-ID-phone_ni8wr0.jpg"
        , "projectSectionHeader": "A Mobile first approach"
        , "projectSectionText":
            { "textCopy": "With their smart phone, customers of an e-commerce brand can scan QR codes on packaging materials to learn more about a brand's sustainability efforts, the life cycle of the packaging materials itself, and how to recycle it with up-to-date, localized disposal options using the latest best practices."
            , "textType": "paragraph"
            }
        , "imageType": "iphone"
        , "fullscreen": false
        }
      , { "imageFile": "lumi-ID-phone-search-results_lwrovs.jpg"
        , "projectSectionHeader": "Real-time localized recycling"
        , "projectSectionText":
            { "textCopy": "Every city has its own regulations, which can make it difficult for a brand's customer service teams to answer questions accurately. Lumi ID is a universal system for every type of packaging tied to real-time data, giving users accurate information about a brand's packaging materials, sustainability mission and certifications."
            , "textType": "paragraph"
            }
        , "imageType": "iphone"
        , "fullscreen": false
        }
      , { "imageFile": "lumi-ID-desktop-FJ-profile_rtezgo.jpg"
        , "projectSectionHeader": "Brand narrative"
        , "projectSectionText":
            { "textCopy": "From the brand's dashboard, not only can companies provide localized recycling information and life cycle information about their packaging, but also share their brand's environmental mission and link to their sustainability page."
            , "textType": "none"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "lumi-ID-desktop-FJ-settings-detail_fs4klu.jpg"
        , "projectSectionText":
            { "textCopy": ""
            , "textType": "none"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "lumi-ID-sample-code_infbme.png"
        , "projectSectionText":
            { "textCopy": ""
            , "textType": "none"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "lumi-lumicodes-photography_psehau.jpg"
        , "projectSectionHeader": "Augmented Reality for a healthier planet"
        , "projectSectionText":
            { "textCopy": "From physical touch points (on an e-commerce brand's packaging materials) users can scan the QR code from their phone to learn more about the brand's sustainability efforts, the life cycle of their packaging materials, and how best to recycle the materials based on localized information."
            , "textType": "none"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      ]
  , "skills":
      [ "Product design"
      , "User research"
      , "UI/UX Development"
      ]
  , "industry":
      [ "Sustainability"
      ]
  , "productType":
      [ "Augmented reality"
      , "Mobile application"
      ]
  },
  { "id": 3
  , "slug": "arrivals"
  , "title": "The Arrivals"
  , "subtitle": "UI/UX, Development"
  , "description": "The Arrivals is a NYC based fashion line focusing on classic, architecturally-inspired garments exclusively available online."
  , "summary": "Principle product designer & front-end engineer responsible for the creation and implementation of interface designs for a responsive, cross-platform e-commerce web app. Translating marketing needs and promotions into a highly polished user experience, as well as designing and developing bi-weekly interactive campaigns, supporting multiple product launches, and improved the site interface based on A/B studies."
  , "backgroundColor": "#36060A"
  , "imageKey": "arrivals"
  , "indexImage": "index_zpp9zz.jpg"
  , "sections":
      [ { "imageFile": "desktop-00-alt_jg0jcn.jpg"
        , "projectSectionHeader": "Context"
        , "projectSectionText":
            { "textCopy": "As a high-end NYC fashion line, The Arrivals required bi-weekly interactive campaigns, supporting continuous product launches. Creating new campaign designs in regular sprint intervals required standardization of the Arrival's branded visual design system and prioritizing high impact & fast turn over of designs."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "desktop-01_wzpfw6.jpg"
        , "projectSectionHeader": "Leveraging interest"
        , "projectSectionText":
            { "textCopy": "The interactive e-commerce store was designed & developed to display the rich array of products in multiple-styles, with a focus on the consumer user navigation experience by creating sorting filters based on best selling, price or inventory. With user analysis we learned that many of our customers purchased item regardless of traditional fashion categories of 'Men' vs. 'Women' so we introduced a filter option for 'Genderless' apparel items."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "desktop-02-alt_qpzl9s.jpg"
        , "projectSectionHeader": "Detailed garment information & product suggestions"
        , "projectSectionText":
            { "textCopy": "Product detail pages needed to display rich imagery detailing the product's aesthetic as well as information regarding fit, materials, and allowing users to receive contextual information before making a purchase commitment. As well as a UI design to provide suggestions of similar product styles to convert user interest into more potential purchasing options."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "phone-00-alt_klkoug.jpg"
        , "projectSectionHeader": "View/buy from anywhere"
        , "projectSectionText":
            { "textCopy": "As an e-commerce brand, The Arrivals needed mobile-first designs so users could view and purchase products across any device type, and a responsive website UX was designed & developed."
            , "textType": "paragraph"
            }
        , "imageType": "iphone"
        , "fullscreen": false
        }
      , { "imageFile": "phone-01_mi5u4f.jpg"
        , "projectSectionHeader": "An architectural interface"
        , "projectSectionText":
            { "textCopy": "With an emphasis on its architectural roots, a structural & textured UI was created focusing on visually displaying compelling imagery and video content."
            , "textType": "paragraph"
            }
        , "imageType": "iphone"
        , "fullscreen": false
        }
      , { "projectSectionHeader": "The results"
        , "projectSectionText":
            { "textCopy": "Creating The Arrivals e-commerce platform from 0-1 launch resulted in 30% year-over-year revenue growth from our debut. The Arrivals became a globally recognized outerwear leader and won  Fast Company's 'Most Innovative Companies' award for design excellence."
            , "textType": "paragraph"
            }
        , "imageType": "none"
        , "fullscreen": false
        }
      ]
  , "skills":
      [ "Product Design"
      , "UI/UX Development"
      ]
  , "industry":
      [ "Fashion"
      ]
  , "productType":
      [ "E-commerce application"
      ]
  },
  { "id": 4
  , "slug": "suited"
  , "siteUrl": "https://suitedmagazine.com/"
  , "title": "SUITED Magazine"
  , "subtitle": "UI/UX, Development"
  , "description": "SUITED is a biannual fashion and art publication with a singular mission in mind: to celebrate those who have found what they are well-suited for."
  , "summary": "Product designer and front-end engineer for the premier launch of the online edition SUITED magazine. Created a customized CMS driven template design built on top of the SquareSpace developer platform. Collaborated one-on-one with the Creative Director & Editor-in-Chief to translate the print publication brand into a digital experience."
  , "backgroundColor": "#010101"
  , "imageKey": "suited"
  , "indexImage": "index_cxa5mu.jpg"
  , "fullscreen": false
  , "sections":
      [ { "imageFile": "desktop-02-alt_lxw4wk.jpg"
        , "projectSectionHeader": "Context"
        , "projectSectionText":
            { "textCopy": "As a print publication, translating the SUITED experience online focused on designing a UI that highlights rich imagery and featured content. As content needed to be regularly updated, a custom CMS driven template was created on top of the SquareSpace developer platform."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "desktop-01-alt_sh0epo.jpg"
        , "projectSectionHeader": "Foundations to print"
        , "projectSectionText":
            { "textCopy": "Because SUITED's initial experience was their printed content, the site was designed to highlight previous issues and leverage site visits into opportunities for users to order hard copies."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "desktop-00-alt_nzitee.jpg"
        , "projectSectionHeader": "Minimalist aesthetic"
        , "projectSectionText":
            { "textCopy": "SUITED magazine's aesthetic is minimal, black & white and high-end. The site was designed to emphasize the physical experience into a fashion and art focused digital site."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": false
        }
      , { "imageFile": "phone-00_fhkper.jpg"
        , "projectSectionHeader": "View from any device"
        , "projectSectionText":
            { "textCopy": "Mobile accessibility was of importance so users could experience the site across a variety of devices. The site was designed and developed mobile-first."
            , "textType": "paragraph"
            }
        , "imageType": "iphone"
        , "fullscreen": false
        }
      , { "imageFile": "phone-01_dpupjy.jpg"
        , "projectSectionHeader": "Strong imagery & typography"
        , "projectSectionText":
            { "textCopy": "With its roots as a print publication, the UI was designed to emphasize the rich imagery & strong typography of the editorial."
            , "textType": "paragraph"
            }
        , "imageType": "iphone"
        , "fullscreen": false
        }
      , { "projectSectionHeader": "Analysis"
        , "projectSectionText":
            { "textCopy": "Working directly with the Creative Director & Editor-in-Chief, SUITED's digital debut expanded their user base to a global scale without the limitations of requiring a physical copy of the publication. From 0-1 launch, SUITED doubled engagement with users and increased print sales from app purchases by 15%."
            , "textType": "paragraph"
            }
        , "imageType": "none"
        , "fullscreen": false
        }
      ]
  , "skills":
      [ "Product Design"
      , "UI/UX Development"
      ]
  , "industry":
      [ "Fashion"
      , "Editorial"
      ]
  , "productType":
      [ "Digital publication"
      , "E-commerce application"
      ]
  },
  { "id": 5
  , "slug": "data-visualization"
  , "title": "Data Visualization"
  , "subtitle": "Visual design, Development"
  , "description": "Data visualization of language patterns and lyrical analysis of top Billboard charting songs over the 20th century."
  , "summary": "Creative director & developer of a data visualization examining language patterns in musical lyrics over time, revealing cultural trends and moods of different time periods as expressed in top-charting songs. Presented as large format digital images and print posters."
  , "imageKey": "data-viz"
  , "indexImage": "index_ojot2o.jpg"
  , "backgroundColor": "#010101"
  , "sections":
      [ { "projectSectionHeader": "The question"
        , "projectSectionText":
            { "textCopy": "What do popular song lyrics say about cultural moods, concerns and political issues of different times? To answer this question and because no database of this information existed at the time, a Python web scraping script was developed to pull lyrics from the top Billboard charts since its inception in the early 1900's."
            , "textType": "paragraph"
            }
        , "imageType": "none"
        , "fullscreen": false
        }
      , { "imageFile": "00_nl0ni3.jpg"
        , "projectSectionHeader": "Visualizing the data"
        , "projectSectionText":
          { "textCopy": "Using a Java based IDE and natural language processing, frequencies of noun entities (such as \"I\" and \"you\"), as well as common verbs that express relationships between those entities (such as \"love\", or \"hate\") were visualized."
          , "textType": "none"
          }
        , "imageType": "screenshot"
        , "fullscreen": true
        }
      , { "imageFile": "02_ydrfxz.jpg"
        , "projectSectionText":
            { "textCopy": "With this data visualization, topical patterns over time became evident as song lyrics from different decades reveal societal patterns and trending topics."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": true
        }
      , { "imageFile": "01_bs8nk7.jpg"
        , "projectSectionText":
            { "textCopy": "Frequency of keywords were used to weight their size (more frequent use of a noun phrase resulted in a larger font size), and bézier curves to visualize semantic linkages between different keyword entities."
            , "textType": "paragraph"
            }
        , "imageType": "screenshot"
        , "fullscreen": true
        }
      , { "imageFile": "03_yxsgpe.jpg"
        , "projectSectionText":
            { "textCopy": ""
            , "textType": "none"
            }
        , "imageType": "screenshot"
        , "fullscreen": true
        }
      , { "imageFile": "04_eazea6.jpg"
        , "projectSectionText":
            { "textCopy": ""
            , "textType": "none"
            }
        , "imageType": "screenshot"
        , "fullscreen": true
        }
      ]
  , "skills":
      [ "Creative Direction"
      , "Visual Design"
      , "Data Visualization"
      , "Development"
      ]
  , "industry":
      [ "Music"
      ]
  , "productType":
      [ "Data visualization"
      , "Print"
      ]
  }
]